function setup() {
  createCanvas(windowWidth, windowHeight);
}

function draw() {
  background(0);//背景黑色
  stroke(255)//框線顏色(255是白色)
  noFill();//不要充滿顏色
  rectMode(CENTER)//以方框中心點為座標點

  // ellipse(25,25,50)//在座標(25,25)畫一個直徑50的圓
  // rect(25,25,50)//方框座標
  // ellipse(50,50,25)

  // ellipse(25+50,25,50)//在座標(25,25)畫一個直徑50的圓
  // rect(25+50,25,50)//方框座標
  // ellipse(50+50,50,25)

  // ellipse(25+(2*50),25,50)//在座標(25,25)畫一個直徑50的圓
  // rect(25+(2*50),25,50)//方框座標
  // ellipse(50+(2*50),50,25)

  // ellipse(25+(3*50),25,50)//在座標(25,25)畫一個直徑50的圓
  // rect(25+(3*50),25,50)//方框座標
  // ellipse(50+(3*50),50,25)

  // ellipse(25+(4*50),25,50)//在座標(25,25)畫一個直徑50的圓
  // rect(25+(4*50),25,50)//方框座標
  // ellipse(50+(4*50),50,25)

  // ellipse(25+(5*50),25,50)//在座標(25,25)畫一個直徑50的圓
  // rect(25+(5*50),25,50)//方框座標
  // ellipse(50+(5*50),50,25)

  // for(var i =0;i<(width/50);i=i+1)//i++ ==>1=1+1
  // {
  //   ellipse(25+(i*50),25,50)//在座標(25,25)畫一個直徑50的圓
  //   rect(25+(i*50),25,50)//方框座標
  //   ellipse(50+(i*50),50,25)
  // }

  // for(var i =0;i<(width/50);i=i+1)//i++ ==>1=1+1
  // {
  //   ellipse(25+(i*50),25+50,50)//在座標(25,25)畫一個直徑50的圓
  //   rect(25+(i*50),25+50,50)//方框座標
  //   ellipse(50+(i*50),50+50,25)
  // }

  // for(var i =0;i<(width/50);i=i+1)//i++ ==>1=1+1
  // {
  //   ellipse(25+(i*50),25+(2*50),50)//在座標(25,25)畫一個直徑50的圓
  //   rect(25+(i*50),25+(2*50),50)//方框座標
  //   ellipse(50+(i*50),50+(2*50),25)
  // }

  // for(var i =0;i<(width/50);i=i+1)//i++ ==>1=1+1
  // {
  //   ellipse(25+(i*50),25+(3*50),50)//在座標(25,25)畫一個直徑50的圓
  //   rect(25+(i*50),25+(3*50),50)//方框座標
  //   ellipse(50+(i*50),50+(3*50),25)
  // }

  for(var j=0;j<(height/50);j++){
    for(var i=0;i<(width/50);i=i+1)
    {
        ellipse(25+(i*50),25+(j*50),50+mouseX/10)//在座標(25,25)畫一個直徑50的圓
        stroke("#588157")
        rect(25+(i*50),25+(j*50),50)//方框座標
        stroke("#ef476f")
        ellipse(50+(i*50),50+(j*50),25+mouseY/5)
        stroke(255)
      }

    }
}
